Revit 2027 API
ReferenceIntersector.Find Method
 Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ReferenceWithContext> Find(
	XYZ origin,
	XYZ direction
)
Public Function Find (
	origin As XYZ,
	direction As XYZ
) As IList(Of ReferenceWithContext)
public:
IList<ReferenceWithContext^>^ Find(
	XYZ^ origin,
	XYZ^ direction
)
member Find :
        origin : XYZ *
        direction : XYZ -> IList<ReferenceWithContext>
Parameters
origin XYZ
 The origin of the ray.
direction XYZ
 The direction of the ray.
Return Value
IList<ReferenceWithContext>
 A collection containing the intersected references.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace